In [ ]:
# Creation of dataframes with Pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame(np.random.randn(2,3), columns=["First", "Second", "Third"], index=["a", "b"])
df

      First    Second     Third
a  1.699077  0.725544 -0.368596
b  1.105148  0.501836  0.524282

In [3]:
df.index # "row names"

Index(['a', 'b'], dtype='object')

In [4]:
df.columns  # "column names"

Index(['First', 'Second', 'Third'], dtype='object')

In [5]:
df2=pd.DataFrame(np.random.randn(2,3), index=["a", "b"])
df2

          0         1         2
a -1.650977 -2.159514  0.167042
b  1.069168 -1.320360  1.879226

In [6]:
df2.columns

RangeIndex(start=0, stop=3, step=1)

In [7]:
s1 = pd.Series([1, 2, 3])
s1

0    1
1    2
2    3
dtype: int64

In [8]:
# Giving a name for the Series object with name attribute

s2 = pd.Series([4,5,6], name="b")
s2

0    4
1    5
2    6
Name: b, dtype: int64

In [9]:
# Crating a dataFrame and a column name
pd.DataFrame(s1, columns=["a"])

   a
0  1
1  2
2  3

In [10]:
# name attribute of Series s2 as the column name
pd.DataFrame(s2)

   b
0  4
1  5
2  6

In [11]:
# Multiple columns
pd.DataFrame({"a": s1, "b": s2})

   a  b
0  1  4
1  2  5
2  3  6

In [12]:
# First way to create DataFrames from rows

df=pd.DataFrame([{"Wage" : 1000, "Name" : "Jack", "Age" : 21}, 
                 {"Wage" : 1500, "Name" : "John", "Age" : 29}])
df

   Wage  Name  Age
0  1000  Jack   21
1  1500  John   29

In [13]:
# Second way. Columns parameter to specify the exact order

df = pd.DataFrame([[1000, "Jack", 21], [1500, "John", 29]], columns=["Wage", "Name", "Age"])
df

   Wage  Name  Age
0  1000  Jack   21
1  1500  John   29